In [2]:
import pandas as pd
import io

In [3]:
LSMS1=pd.read_csv(r'C:\Users\flavi\Downloads\data for practice\sect11b_harvestw3.csv')
LSMS2=pd.read_csv(r'C:\Users\flavi\Downloads\data for practice\sect3_plantingw3.csv',low_memory=False)

In [4]:
LSMS1.rename(columns={'s11bq4': 'expenditure',},inplace=True)
LSMS1.rename(columns={'s11bq3':'purchase'},inplace=True)

In [5]:
LSMS2.rename(columns={"s3q13a": 'labour_type'}, inplace=True)
LSMS2.rename(columns={'s3q21a': 'Income_dist',},inplace=True)

In [6]:
LSMS2.dropna(subset=['Income_dist'],inplace=True)
LSMS1.dropna(subset=['expenditure'],inplace=True)
LSMS2.dropna(subset=['labour_type'],inplace=True)

In [7]:
LSMS1_data_list=['KEROSENE', 'PALM KERNEL OIL', 'OTHER LIQUID COOKING FUEL', 'ELECTRICITY', 'CANDLES', 'FIREWOOD', 'CHARCOAL', 
                'PETROL','DIESEL']
LSMS1_sv=LSMS1[LSMS1.item_desc.isin(LSMS1_data_list)]

In [8]:
from datar.all import case_when, f, mutate, pivot_wider
LSMS_df=mutate(LSMS1_sv,state_name=case_when(f.state==1,'Abia', f.state==2,'Adamawa',f.state==3,'Akwa Ibom',
                                                         f.state==4,'Anambra',f.state==5,'Bauchi',f.state==6,'Bayelsa',
                                                          f.state==7,'Benue',f.state==8,'Borno',f.state==9,'Cross River',
                                                       f.state==10,'Delta', f.state==11,'Ebonyi',f.state==12,'Edo', 
                                                        f.state==13,'Ekiti', f.state==14,'Enugu',f.state==15,'Gombe',
                                                        f.state==16,'Imo',f.state==17,'Jigawa',f.state==18,'Kaduna',
                                                          f.state==19,'Kano',f.state==20,'Katsina',f.state==21,'Kebbi',
                                                         f.state==22,'Kogi',f.state==23,'Kwara',f.state==24,'Lagos',
                                                         f.state==25,'Nasarawa',f.state==26,'Niger',f.state==27,'Ogun',
                                                         f.state==28,'Ondo',f.state==29,'Osun',f.state==30,'Oyo',
                                                         f.state==31,'Plateau',f.state==32,'Rivers',f.state==33,'Sokoto',
                                                        f.state==34,'Taraba',f.state==35,'Yobe',f.state==36,'Zamfara',
                                                         f.state==37,'FCT Abuja')
                                        .drop(columns='state'))
LSMS_df

[2022-07-19 12:40:50][datar][WARNING] Package `pdtypes` not installed for `options(enable_pdtypes=True)`
C:\Users\flavi\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.10_qbz5n2kfra8p0\LocalCache\local-packages\Python310\site-packages\pipda\function.py:147: FutureWarning: In a future version of pandas all arguments of Series.drop except for the argument 'labels' will be keyword-only.
  return func(*args, **kwargs)  # type: ignore

,zone,state,lga,sector,ea,hhid,item_cd,item_desc,purchase,expenditure,state_name
0,4,1,115,1,670,10001,301,KEROSENE,1.0,750.0,Abia
4,4,1,115,1,670,10001,305,ELECTRICITY,1.0,3500.0,Abia
30,4,1,115,1,670,10002,301,KEROSENE,1.0,750.0,Abia
34,4,1,115,1,670,10002,305,ELECTRICITY,1.0,5000.0,Abia
38,4,1,115,1,670,10002,309,PETROL,1.0,15000.0,Abia
...,...,...,...,...,...,...,...,...,...,...,...
137138,1,37,3702,1,972,370030,309,PETROL,1.0,20000.0,FCT Abuja
137198,1,37,3706,2,6,370032,309,PETROL,1.0,2000.0,FCT Abuja
137288,1,37,3706,2,6,370035,309,PETROL,1.0,1600.0,FCT Abuja
137408,1,37,3706,2,6,370039,309,PETROL,1.0,10000.0,FCT Abuja
137438,1,37,3706,2,6,370040,309,PETROL,1.0,1200.0,FCT Abuja

In [9]:
LSMS2.rename(columns={'s3q13a': 'labour_type',},inplace=True)

In [10]:
LSMS2

,zone,state,lga,sector,ea,hhid,indiv,s3q1,s3q2,s3q3,...,s3q35a,s3q35b,s3q36,s3q37a,s3q37b,s3q38,s3q38a,s3q39_new,s3q39a_new,s3q40_new
0,4,1,115,1,670,10001,1,1,2.0,2.0,...,NaN,NaN,NaN,NaN,NaN,2.0,2.0,NaN,2.0,NaN
1,4,1,115,1,670,10001,2,1,1.0,NaN,...,NaN,NaN,NaN,NaN,NaN,2.0,2.0,NaN,2.0,NaN
3,4,1,115,1,670,10001,4,1,1.0,NaN,...,NaN,NaN,NaN,NaN,NaN,2.0,2.0,NaN,2.0,NaN
5,4,1,115,1,670,10002,1,1,1.0,NaN,...,NaN,NaN,NaN,NaN,NaN,2.0,2.0,NaN,2.0,NaN
6,4,1,115,1,670,10002,2,1,1.0,NaN,...,NaN,NaN,NaN,NaN,NaN,2.0,2.0,NaN,2.0,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
26658,1,37,3702,1,972,370030,2,1,2.0,1.0,...,NaN,NaN,NaN,NaN,NaN,1.0,2.0,NaN,2.0,NaN
26663,1,37,3706,2,6,370031,1,1,2.0,3.0,...,NaN,NaN,NaN,NaN,NaN,2.0,2.0,NaN,2.0,NaN
26705,1,26,2609,1,0,370036,1,1,1.0,NaN,...,NaN,NaN,NaN,NaN,NaN,1.0,2.0,NaN,2.0,NaN
26711,1,37,3706,2,6,370037,1,1,2.0,2.0,...,NaN,NaN,NaN,NaN,NaN,2.0,2.0,NaN,2.0,NaN
26720,1,37,3706,2,6,370039,1,1,2.0,4.0,...,1.0,NaN,2.0,NaN,NaN,1.0,2.0,NaN,2.0,NaN

In [11]:
LSMS2_sv=LSMS2[['state','labour_type','Income_dist']]

In [15]:
LSMS2_sv

       state                              labour_type  Income_dist
0          1                            CIVIL SERVANT      67800.0
1          1                            CIVIL SERVANT      42300.0
3          1                                    NANNY      12000.0
5          1                          LEGALPRACTIONER     150000.0
6          1                           ADMINISTRATION      64200.0
...      ...                                      ...          ...
26658     37                               ACCOUNTANT      36000.0
26663     37  DANTATA AND CO (CHIEF SECURITY OFFICER)      80000.0
26705     26                            CIVIL DEFENCE     130000.0
26711     37                  MANAGER( BLOCK INDUSTR)      20000.0
26720     37                               ACCOUNTANT      73000.0

[1201 rows x 3 columns]

In [16]:
LSMS2_df=mutate(LSMS2_sv,state_name=case_when(f.state==1,'Abia', f.state==2,'Adamawa',f.state==3,'Akwa Ibom',
                                                         f.state==4,'Anambra',f.state==5,'Bauchi',f.state==6,'Bayelsa',
                                                          f.state==7,'Benue',f.state==8,'Borno',f.state==9,'Cross River',
                                                       f.state==10,'Delta', f.state==11,'Ebonyi',f.state==12,'Edo', 
                                                        f.state==13,'Ekiti', f.state==14,'Enugu',f.state==15,'Gombe',
                                                        f.state==16,'Imo',f.state==17,'Jigawa',f.state==18,'Kaduna',
                                                          f.state==19,'Kano',f.state==20,'Katsina',f.state==21,'Kebbi',
                                                         f.state==22,'Kogi',f.state==23,'Kwara',f.state==24,'Lagos',
                                                         f.state==25,'Nasarawa',f.state==26,'Niger',f.state==27,'Ogun',
                                                         f.state==28,'Ondo',f.state==29,'Osun',f.state==30,'Oyo',
                                                         f.state==31,'Plateau',f.state==32,'Rivers',f.state==33,'Sokoto',
                                                        f.state==34,'Taraba',f.state==35,'Yobe',f.state==36,'Zamfara',
                                                         f.state==37,'FCT Abuja')
                                        .drop(columns='state'))
LSMS2_df

C:\Users\flavi\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.10_qbz5n2kfra8p0\LocalCache\local-packages\Python310\site-packages\pipda\function.py:147: FutureWarning: In a future version of pandas all arguments of Series.drop except for the argument 'labels' will be keyword-only.
  return func(*args, **kwargs)  # type: ignore

       state                              labour_type  Income_dist state_name
0          1                            CIVIL SERVANT      67800.0       Abia
1          1                            CIVIL SERVANT      42300.0       Abia
3          1                                    NANNY      12000.0       Abia
5          1                          LEGALPRACTIONER     150000.0       Abia
6          1                           ADMINISTRATION      64200.0       Abia
...      ...                                      ...          ...        ...
26658     37                               ACCOUNTANT      36000.0  FCT Abuja
26663     37  DANTATA AND CO (CHIEF SECURITY OFFICER)      80000.0  FCT Abuja
26705     26                            CIVIL DEFENCE     130000.0      Niger
26711     37                  MANAGER( BLOCK INDUSTR)      20000.0  FCT Abuja
26720     37                               ACCOUNTANT      73000.0  FCT Abuja

[1201 rows x 4 columns]

In [14]:
LSMS2_df

       state                              labour_type  Income_dist state_name
0          1                            CIVIL SERVANT      67800.0       Abia
1          1                            CIVIL SERVANT      42300.0       Abia
3          1                                    NANNY      12000.0       Abia
5          1                          LEGALPRACTIONER     150000.0       Abia
6          1                           ADMINISTRATION      64200.0       Abia
...      ...                                      ...          ...        ...
26658     37                               ACCOUNTANT      36000.0  FCT Abuja
26663     37  DANTATA AND CO (CHIEF SECURITY OFFICER)      80000.0  FCT Abuja
26705     26                            CIVIL DEFENCE     130000.0      Niger
26711     37                  MANAGER( BLOCK INDUSTR)      20000.0  FCT Abuja
26720     37                               ACCOUNTANT      73000.0  FCT Abuja

[1201 rows x 4 columns]